package xyxgame.bazhi2;

import java.lang.reflect.Array;
import java.util.Arrays;
import java.util.List;

public class BaZhiSay3 {

    public static List<String> shigan = Arrays.asList("甲", "乙", "丙", "丁", "戊", "已", "庚", "辛", "壬", "癸");
    public static List<String> niangan = Arrays.asList("甲", "乙", "丙", "丁", "戊", "已", "庚", "辛", "壬", "癸");
    public static List<String> baisay = Arrays.asList(
            "此命为人聪明，立志孤高，多学少成，博闻强记，中年自嫌孤独，四旬之后，却喜得遇贵人有贵人酒食，无贵人财帛，大事化小，小事化无，作事疑虑，相识易疏，爱恬淡乐清虚，只因立性不定，几番进退超趑，不骄不吝，不傲不谄，志气豪逸，心性难拘，儿女不得力，尽是一埸空，吁嗟乎，半俗之命。",
            "此命性格恬淡，胆气英豪，凡事不能深思远虑，几番有始无终，被人当面相讥，因此改变重重。凶处不凶，美处不美，初年壮健精神，中年心灰意懒，好事多磨，灾危淹滞，是非得失，巧中成拙，纵使成家立业，不免离别妻子，有贵人酒食缘，无贵人财帛分，只好半空半谷，此造化所招也。",
            "此命乃艺业工巧之星，学术清明之宿，孤又孤不了，俗又俗不了，患难中凶不成凶，成立处福不为福，高人钦敬，小辈妒嫌，能立纪纲，会审法度，自在处寻出不自在，欢喜处变作一场愁，兄弟有若无，亲戚不到头，件件亲手，般般自造，皆造化所致。",
            "此命眉清目秀，性格轩昂，随机知变，知高识低，分尊卑，别贵贱，只缘心高志大，因此踪迹不宁，大宽小急，紧慢不匀，忘前失后，会施为，能妆饰，历风霜，却得凶中变吉，目下恶星将出限，福临财至尽无疑。",
            "此命慵懒之宿，暗昧之星，作事重重退悔，行坐步步踌躇，不能俯仰人，不会妆饰事，衣食自有只宜改变，守祖则六亲无分，静坐则四肢生病，只宜过房立赘，离祖立身，性情紧慢不调，事业成败不一，从来险阻曾经过，幸得凶中有救神。",
            "此命福度之曜，祥瑞之星，安静处生出罗唣，尴尬处却有救神，巧中成拙，是处成非，亲戚浑如陌路人，外方却有知音者，夫妻瓜皮对柳树，兄弟铜盆对铁帚，难为儿女，独力担当，到头还有好收成。",
            "此命作事刚柔，处心度量，劳心见早，发福来迟，要通未通，要迟未迟，立心不一，有始无终，外观不足，六亲无分，子宜迟，只宜螟蛉作赘，不然则庶出偏生，目前有件踌躇事，百样思量百样忧，若还谋做经营客，有名无实不成功。",
            "此命如雀巢生凤，蚌腹剖珠，作事先难后易，只宜离祖安居，眷属生疏，或是过房作赘，不宜守祖根株，心慈口直，于人不足，大宽小急，只为心忙，初限偏枯，晚年发达。",
            "此命乃名利之曜，福禄之星，自成规矩，自创门庭，风中败叶，水上浮萍，三迟三早之命，当家早，劳心早，忧虑早，发禄迟，妻子迟，享福迟，命中有救神，不犯官刑，凶事不成凶，好处不见好，若要事十全，直待寿年老。",
            "此乃性禀五行之秀，福居百顺之祥，声轰震世之雷，气达刚柔之象，心性巧，机谋深，多学少成，有头无尾，般般件件劳心，口躁，伤人常招不是，心慈反成冤怨，男女多生少收，妻硬无伤，若要安宁，且待虎游鼠穴。",
            "此命运限颠倒，事业艰难，幼年虽现成规模，亦费经营，万般制度，三思进退，百种萦回，宗族抛离，资财聚散，凶中变吉，笑里成忧，远方有知音，亲识恰如仇，或向阴骘门中，立个家计，别处寻个出头，男子难招，女子为吉。",
            "此命淹延退悔，自在安闲之境，我要行，他要住，我要来，他要去，百物不顺，百事进退，多学少成，作事虎头蛇尾，为求人，不采人，凶不凶，吉不吉。",
            "此命凤出鸡巢，龙生蛇腹，性紧多谋，心怀不足，作事进退踌躇，自在中生出辛苦，安静中道出是非，尽心竭力，做事无成，如花开逢夜雨，月皎遇行云，却为陪钱，不知省用，强施设，硬追陪，如草堂下挂珠帘，只因好看，不知度量。",
            "此命乃虚名之星，不显之宿，孤独自在，无现成福，祖财难得，亲戚无情，知心者少，我知者多，却得天禄作主，险处不险，凶处不凶，用心多历事少，身闲心不闲，财多福便少，清净是家风，方可到年老。",
            "此命好比仙女耕田，王乔汲水，安闲处生出辛苦，享福处不得优游，虽是为人慷慨，见识高明，未免巴巴成三四年规模，区区立一两番家计，般般亲费力，件件自当心，有子不得力，有福享难固，性直无私，每向恩中招怨。",
            "此命凿山开路，掘井汲泉，用尽功夫心力，会施为，能摆布，知轻重，别贤愚，虽则智量深沈，奈何运限驳杂，蜈蚣会走，不如蜓蛐，身如不击舟，命如初生月，莫恨所为多进退，只因时节未相逢。",
            "此命金玉光彩之星，福禄慈祥之宿，节驱驾，喝大采，勤烧香，懒念佛，有救人之心，无伤人之意，要使大钱，能吃大饭，逃难处寻得一路，省力处却受淹留，般般费力，件件劳心，小辈无情，大人见喜。",
            "此命为人有调度，有机谋，胸襟洒落，气宇高明，生来磨难，曾经霜雪，遇贵有如不遇，有亲却似无亲，懒悔中多头少尾，进退处有始无终，夫妻大宜因亲致亲，子息只宜失一得一，生涯不宜守旧，活计只宜靠新，兄弟难和，父母少依。",
            "此命钢纪权衡之宿，人若逢之，有开基创业之功，靠祖成身之福，刚柔两济，凶吉同门，性刚气高，心慈口毒，开眉变皱眉，现成变不足，只因不耐俯仰时人，以致几番拗曲作直，若是知命耐烦，自然衣食丰足。",
            "此命常招呕气是非，心慈口直，事不藏机，不受人触，不吃人亏，所谓作事迂回，钱财东来西去，妻子宜迟，先男后女，多学少成，空有千方百计。",
            "此命风云际会之星，君臣和好之宿，所憎邪佞，会解凶灾，作事不肯缩头，能会摆布，平生事业如同燕子营巢，一世亲情好似小儿藏面，身心不足，两足常忙，易荣枯，多翻覆，伤妻害子，破祖成家之命。",
            "此命玉润金辉，人皆仰慕，可谓种鼎之器，栋梁之材，惜嫌神重，故好事迂回，翻覆处劳而无功，辛苦处做事不实，吁嗟乎，好事从来不十全，彩云易散，玻璃易碎，本是轩昂头角，奈何运限未通，行得龙吟，忽然豹变。",
            "此命乃官禄之宿，功名之星，自合身荣位显，奈何限晦迟迟，会施为懒俯仰，于人不足好事多磨，恩人反作仇冤，亲者如同陌路，三不足三不办，科名不足，家园不足，儿女不足，等闲莫怨劳心早，上山须有下山时。",
            "此命近贵，有沾濡雨露之恩，风云际会之象，怎奈五行驳杂，变成萧索，家风中陷，迂回蹉跎，事业要清闲未得清闲，图名利反失名利，还了许多业债，受了多少风霜，有话不藏机，有事不忍耐，巧中藏拙，是处成非，平生财帛，成似风云去如东海。，有如千叶桃花，秀而不实，外视有余，内赏不足，生涯成败虚名禄，好似杨花比木瓜。",
            "此命一团和气，满面春风，逢人有亲兄弟之情，作事有春风之志，识重知轻，量长较短，善斟酌，会调停，险难中能区解，辛勤中会经营，性急心慈，心无狠毒，草屋下要设琴棋书画，布衣上要带金玉犀环，一生只要安排好，只要坚心牢守命，自然春至百花香。",
            "此命半虚半实，或浊或清，俗不俗孤不孤，爱打鼓敲板，沉埋志气，孤召聪明，心身不定多破多成，若不破祖离宗，也须迁移门户，朝生天台南岳，暮长五台北京，若得不险不阻，暗疾可保无凶无险，前程历得风霜早，多少基业得现成。",
            "此命心性不常，易嗔易喜，省力处反作蹭蹬，现成处变作辛勤，目下无忧，心不自在，虽然一个好基础，受过许多磨难处，多破少成，招是招非，妻非生铁纯钢，定见前孤后寡，头男未得，末子可收，摆布有精神，般般亲手做，先难后易，心不在忙。",
            "此命有机谋手段，有钱会用，事多会为，只因命犯退神凶，凭你千般思算起，趁得千钱和万贯，半夜辛勤，只落得手忙脚乱，若要是全，重重改换，只因八字坚牢，纵有凶灾减半，老年胜似少年，后段强如前段，若逢水成身，方是惺惺好汉。",
            "此命本性行事热心，已有事业，翻变成不成，名利蹉跎，可做不做，几番恩里成怨，每向成中见破，把得现成，变成已过，百计千万，退神一个，作事如急风行船，求财如拗驴推磨，也不忍寒，也不耐饥，当遇赤面贵人星，只落得半面知已，若是别处成，须防祖业破，晚景当从容，风霜无见过。",
            "此命轻风涉浪，渡水穿山，襟怀慷慨，骨格清奇，会受用能施为，只因性情刚直，曾经是处成非，耗散资财，官刑退伏，螟蛉是真子，接续乃成亲，弟兄如陌路，朋友如知音，若要十分足，龙蛇混杂真。",
            "此命凶不凶美不美，始辱终荣，后通先否，离祖别亲，移南就北，做事拈花摘果，立身涉浪经霜，翻来复去，雨骤风狂，端下处变作歪邪，安静处做出罗唣，身闲心未稳，心稳足常忙，只因驿马合天空，一世清闲闲未了。",
            "此命监临点检，镇守威权之星，气宇轩昂，机谋广大，作事持强好胜，助力劳心，人说卓卓有余，自恨区区不足，高人见重，小辈妒嫌，曾将忙里偷闲，亦向静中思动，无人替力，独自支持。",
            "此命有见操持，出言有心，作事敢为，性刚不忍，大有深谋，犯退神，险处不危，两叶三花方结子，铜盆铁帚可为妻，曾被小人诬指，惹是招非，改更宜换过，不宜祖宗基，若能傍水寻金友，不为奇处也为奇。",
            "此命虎皮羊质，草屋兽头，外妆好景，内少坚牢，命带退耗神，岂有虚名禄，作事奸疑，为人滔曲，兄弟无情，亲情不睦，口说短长，心无酷毒，几番因是失商量，自向笑中生出哭，伤妻害子破重圆，此是祸中生出福，则是玉蕴石而掩辉，珠藏渊而无媚。",
            "此命自成自立，费力劳心，六亲总是虚花，兄弟如同画饼，热心相成者少，冷眼傍观者多，吃尽多少风霜，受了万般忧愁，运限未通百计不顺，无心逢遇贵人，向冷灰里爆出火，休恋故乡生处乐，受恩深处便为家。",
            "此命妨克六亲，疏远骨肉，离祖迁居，命当孤独，身闲心自大，意懒志齐天，千里浪中行舟，八尺竿头把戏，历事早安闲迟，做事偃蹇，立性蹊跷，自家兄弟全无分，处处交游却有缘，上山虽费力，自有下山时。",
            "此命恩里成怨，巧中成掘，为人倾吐心怀，倒被辜恩负义，亲情不立，兄弟难和，离祖成家，孤寂自立，福如秋夜云遮月，财似春深絮逐风，亲朋交友有如无，一条重担自肩挑，仔细思量，谁人共力。",
            "此命能细算会安排，勤俭为根本，辛苦作人家，命独退神，当进步时不进步，多忧疑处好开怀，奔波劳力早，踏破几双鞋，欢喜成啾唧，端立坐歪邪，兄弟成吴越，父母是冤家，朝思暮算七件事，柴米油盐酱醋茶，要求安乐法，须换别生涯。",
            "此命机谋胆志，性巧心灵，为人虽硬直，只是作事从容，六亲无力，妻子成空，直须两蒂三花，方计一文两贯，守祖不利，更改方宜，随身当带暗疾，三好四怯难医，根基虽稳厚，时运奈乖达，守分知机藏器待时，一朝待到时机转，好事相逢不在迟。",
            "此命如浮云出岫，野鹤唳风，心在四方，与存别处，靠祖难成事业，离乡可立根基，财若井泉，命如风烛，两三番改换衣冠，四五度重立家计，出家未尽，在俗未孤，灾难里有退神相随，伤妻克子，兄弟别离，只见用尽精神，要行清闲潇洒地，奈何身陷火坑中。",
            "此命作事刚直，所为详审，心无私曲，性若风雷，一片慈悲心，三分十非舌，遇贵人陪酒陪歌，件件自劳，般般自历，移桃接李，几番苦处遭伤，换叶移根，多向成中见破，移花折柳方为业，革故鼎新原是命。",
            "此命凶中反吉，笑里成忧，件件犯退神，头头见成破，亲情无义，朋友多缘，性乖伶俐，自然天付，赤心报国，反遭三尺之诛，竭力于人，只作一场话说，吃跌处有人扶持，得钱处有鬼来偷，妻宫准备鼓盆歌，儿女提防离别哭，命无灾晦，祖业消磨，可戒五辛三厌。",
            "此命如芝兰秀于岩上，松柏茂于山间，住处幽远孤高，根无坚实，虽然祖父箕裘好，怎奈生来未得时，六亲不得力，兄弟亦相疏，若非穿耳离亲，定主伤残带破，须信瓜甜终带苦，世间万事十全难。",
            "此命气性轩昂，胸襟洒落，成败不常，进退不定，攘攘求名，区区求利，心中本是闲中客，必要闲时心不闲。",
            "此命苗而不秀，秀而不实，叶密花繁，密云不雨，外观拈花摘叶，内看羊质虎皮，纸糊金刚空大汉，得三钱，去二两，赢人百万，自损三千，救人无恩，谋事多退，凶灾不为吉，好事反成凶，莫嫌受尽脚奔波，多少凶灾留在前。",
            "此命孤中有克，短处求长，只宜赘舍过房，不可靠亲守祖，辛苦早，发福迟，未老先头白，无事生烦恼，千件事难成，三般事不了，第一脚头债，第二骂佛债，第三儿女债，见佛张眉怒目，神昂头不拜，若要后成须见破，黄连根上生甘草，谁信甘从苦中来。",
            "此命如旱苗待雨，枯树待春，要做好事反做拙，于人好处反遭嗔，有福不得福，是亲不是亲，身在襄阳府，心在海涯津，千般忧虑心中有，百样营谋却是无，费尽区处，用尽精神，若要妻宫同到老，直须铁帚与铜盆。",
            "此命心多忧虑，凡事无成，六亲难靠，兄弟情亏，早年根基初限，始立功名懒惰，天晦天暗星照临，暗疾不明，移南就北，革故鼎新，朋友不得力，亲戚多忌怨，只因磨难风霜早，别有高人作主盟。",
            "此命为人正直，立性忧柔，有爱人之心，无伤人之意。大人见重，小辈相轻，只宜异姓同居，不利一身守祖，人情易变，作事炎凉，行好事不得好报，一生衣禄无亏，不犯官刑，只因运晦限迟，以至瓜甜蒂苦，寿无高稳，晚景光华。",
            "此命有机谋，能操持，守法度，立纲纪，善别贤愚，能分皂白，自堪作栋梁大器，可为领袖高人，只因天败星在中宫，以致退神太重，凶事不成，好事易散，百尺竿头曾下足，千重浪里也行舟，因何险里不相妨，只为天机星救护，妻宫力薄，儿女情疏，百斤重担，耐烦挑到底，替著人不足，休嫌蹭蹬，只要心坚。",
            "此命逆行反照，为人自是不拘，作事有始无终，不容情，少通融，夫妻难和，子息宜迟，只手自相扶，六亲不得力，见贵人有缘，钱财无分，与朋友交，赔酒贴钱，背后只落得冷言冷语，用功不赏，救人无恩，千件事当心，算来都是命。",
            "此命性刚有胆气，见快有商量，假饶十步生九计，只得身安心未闲，只因心直口快，出处当如虎营窟，休嫌时未至，随分独支吾，踏破铁鞋无觅处，得来全不费功夫。",
            "此命艰危，早历磨难，曾经亲眷冷如冰，兄弟心如铁，鱼在水中冷暖自知，荆棘中留赤脚，吉星救灾自消磨，安闲中生出烦恼，奔波中变出欢喜，皆是退神来入命，蹉跎蹭蹬未能休。",
            "此命机谋有智，奸狡多疑，有权柄，会操持，无缘招嫡子，有分娶贤妻，命带三刑七杀，身防肉破皮碇，财帛向外方积聚，富贵在家内施为，只因朝暮奉善，到处方便慈悲，得意浓时休进步，临期省得失便宜，若问六亲分，落花流水各东西。",
            "此命初年驳杂，早岁辛勤，劳心劳力，用尽精神，骨肉如冰炭，财帛似风云，百计千万成一事，收来并不见殷勤，近处亲邻却不亲，只合离乡别井去，得安身处且安身。",
            "此命深思远虑，营运劳心，口直心慈性高气硬，受不得曲直，吃不得便宜，分清理白，补短牵长，为事易成，干人事在足，妻弱难为，子多不秀，功名虚，财帛耗，巧里得来空里去，水上浮泡眼前花。",
            "此命为人乔木票格，孤月精神，见事至诚，为人质直，兄弟少和，骨肉相疏，惹是招非，吃亏殴气，用真心反成不是，管闲事心倒忧愁，一生好事多磨，件件虎头蛇尾，身安心不闲，内急外头宽，莫怨生来不遇时。",
            "先后细看此命，如高竿上把戏，立身不稳，海边造屋，立柱难牢，进退多忧疑，百样亲情无份，骨肉成冤，只宜出外自成人，不可靠祖求居立，远则人人相敬，近则个个相轻，有势莫在当方逞，不料他人斗小名，若是离乡背景去，无心却有贵人钦。",
            "此命多思多虑，易败易成，大事难做，小事深信，知进退，识高低，做事沉吟，为人的是，小急大宽，喜怒不常，千斤数两不曾争，一分一厘要算计，于人不足，救人无恩，吉处招凶，凶中反吉，命里有通神，不犯官刑凶狱。",
            "此命识见高低，机谋广大，是非不定，成败不常，会支吾，能区处，奈何运限未运至，名利难成，会砍大树木，烧了夹底锅，巧里来，拙里去，方知由命不由人，时至牛羊，自然享福。",
            "此命有心机，多志气，立性质朴，作事老成，亲情如秋水，骨肉似寒炭，巧谋多进退，举用费商量，施恩招怨恨，烧香引祸殃，好事蹉跎，机会差失，若要心足，骑马乘龙。",
            "此命有心机，多志气，立性质朴，作事老成，亲情如秋水，骨肉似寒炭，巧谋多进退，举用费商量，施恩招怨恨，烧香引祸殃，好事蹉跎，机会差失，若要心足，骑马乘龙。",
            "此宿主人清高近贵，性直心慈，不会苟求，拙于俯仰，五行坚固，四柱安和，情如野鹤栖松，性似寒潭印月，可保永年。",
            "此命心灵百出，性巧多乖，弄假成真，将无作有，亲眷云遮皎月，资财浪里浮萍，好事多磨，利名易失，凶中有救，不犯官刑，只合初年破祖，自成自立经营。",
            "此命孤云出岫，野屋乘风，心在四方，意存他处，向异乡成立，别处经营，东岸栽松西岸秀，南园种竹北园阴，父母如过客，兄弟似残星，不恋故乡生处乐，受恩深处便为家。",
            "此命禀性聪明，所为磊落，磨难早，更变迟，亲眷薄情春暮雪，儿孙无分镜中花，好事难成，胸中进退，平生蹉跎，皆是命也。",
            "此命芝兰秀幽谷，松柏茂深山，兄弟事业难通，父母根基少守，只宜自立，遁入空门，亲谊风中秋叶，人情水上春冰，成败多端，利名进退，命里不应朱紫贵，终须林下作闲人。",
            "此命凶星照命，主有是非，作事多私曲，有刚权，无滔曲，易喜易嗔，易荣易辱，小事不藏，事出言毒，于人不足，亲眷笑中刀，父母风前烛。",
            "此命龙头蛇尾，命犯退神，财逢耗鬼，口快心直，先破后成，夫妻成早，兄弟乘违，千方百计苦经营，财不聚时空费力，要逢通达，直至六旬方可。",
            "此命天孤天星，退神重，只宜离祖自立，不可靠亲享福，重重浪里作生涯，百尺竿头打跟头，只因八字坚牢，根基不能摇动。",
            "此命春林花朵，秋夜蟾光，颜色好看，秀而不实，生涯蹭蹬，活计偏枯，白日奔驰，黄昏思算，进中思退，劳而无功，只因口直伤人，因此小人不足，亲情春后雪，兄弟镜中花。",
            "此命祖宗难靠，亲友无情，欠兄弟之缘，少股肱之力，双手做成家计，独拳创起规模，能干办，会支吾，思量似尽心大，资财有变荣枯。",
            "此命如狂风涉浪，透海穿山，命逢三早三迟，富家事业忧心早，不得安闲子息迟，皆是命中所定。",
            "此命如风雷之象，有声无形，巧中成拙，翻正为邪，得缕三月雨，用似五更潮，虽有多谋，常怀不足，为人替手，少有知心，是亲不是亲，非亲却是亲，妻宜命硬年绵，子息先难后易，若不如此，定有妨克。",
            "此命有刚权，多胆志，机谋机变，高人钦仰，小人憎嫌，头婚防破而复成，忌施恩而反怨，富贵尽辛苦得，老年记取少年时。",
            "此命将相辅弼之星，文武股肱之宿，心无私曲，性有刚柔，能救能放，会吉会凶，一生衣禄不相污，到老寿无终不少，爱闻声争强，会分青理白，妻宜命硬，可保延长。",
            "此命劳心费力，作事辛勤，般般亲手，件件当心，知心得少，吃饭者多，不是惜花春起早，皆因爱月夜眠迟，除却心知别谁，有外方奔波缘，无家中安闲乐。",
            "此命不因祖业而立身，不靠六亲而吃饭，衣食如春草，不种自然生，莫怜弃旧怜新，惟有信小成大，著破铁鞋无觅处，得来全不费工夫。",
            "此命名为三刑恶曜，七杀凶星，人命值之，伤皮破肉，十相不全，口眼歪斜，心性易嗔易喜，所为少吉多凶，不戒三厌五荤，定主一斑半点，伤妻并害子，破祖乃成家。",
            "此命玉堂之曜，金马之星，平生衣禄丰厚，到老退神重大，施恩处亏中吃亏，只因度量宽洪，百事少忧愁，不皱眉。",
            "此命有机谋操略，会用施为，财帛可图，利名不失，坚心守耐，心正不怕壁邪，只防骨肉，亲者如同陌路人，若是离乡千里去，不精神处也精神。",
            "此命在为混沌晦明之曜，在地为重浊昏迷之宿，有始无终，忘前失后，与朋友交，易聚易散，六亲三喜两忧，只宜半俗半空，方许图名图利，妻儿见破，祖业难招，亦宜三姓同居，不宜一身自立。",
            "此命为人见快，作事敢为，岂肯巧言令色，一心中正，反遭衔怨冤仇，百事辛勤，也带官刑口舌，既济于人行好处，一场忧闷自招事。",
            "此命如月被云遮，似镜却生尘，劳心著力，独自成立，六亲冷谈不相投，二姓参差难得合，在家啾啾唧唧，出外喜喜欢欢，瓜甜蒂苦，事无十全，风高浪险自摇船，忧乐书从心上过，辛苦莫怪，安稳有期，黄连甘草合根生，甜苦一般同一处。",
            "此命性刚胆大，志气轩昂，作事藏机，出言压众，挺挺若寒松独秀，娟娟如孤月独明，六亲不相投，兄弟难相处，聚中有散，败中有成，贵人相敬必提携，不作偎衰凝蠢客，欢时运快，好事见迟，一遇知已，官荣极品。",
            "此命能妆饰外景，爱结识好人，立志孤高，天性聪明，作事无私曲，为人有直肠，敢出大言，不怕小人招忌背后怪，相逢见面即相亲，凶中有救吉神多，作事美中成不美。",
            "此命刑杀重，退神多，若不破祖凋亲，定见折指截皮，命带金神七杀，若向竹园松间，做个清闲好人，不若闹市丛中，做个名利之客，担重担轻自肩挑，替力回首无一个，若灭无明之嗔人，不安乐处也安乐。",
            "此命如孤高秋夜月，冷淡晓霜天，于人不足，做事多磨，热心招口舌，平地起风波，事圆时反缺，人从美成嗟，寻常烦恼，每日奔波。",
            "此命难为父母，弃别箕裘，兄弟无力，妻子难求，只好清闲冷淡，不宜运用求谋，一番事业两番收，一处身心两处优，高人钦仰，小人妒忌，因为初年伶俐，反交中路淹留，自有高人相举用，不须骑马上扬州。",
            "此命五行安稳，，四柱和平，财帛现成，兹基守旧，名夸里巷，德誉乡邻，只因星犯天灾，合见身生暗疾，财帛易散，一生多是多非，虽然作事退神多，终究还他生富贵。",
            "此命为人特达，处事精祥，耐事时如弥陀酣睡，不耐事时如金刚擎拳，有刚柔，无滔曲，是非绊足，名利拘身，儿女不知心，亲情尽无义，朝思暮算，五更只得二更眠，千方百计，三限还他一限好，风霜早历千千遍，方做自在清闲人。",
            "此命聪明心性，磊落身材，知高低，分轻重，外头好看，心内多忧，与人恩深，小人不足。",
            "此命说长论短三寸舌，移南换北一生心，苍忙惹出是非事，恩爱反成烦恼出，兄弟各生异念，朋友不遇知心，惺惺反做不惺惺，只为当年运未平，待得青龙行大海，自然平地震雷声。",
            "此命主多忧心，思虑击绊，恩怨重重，劳心费力，欲达不成，百事蹉跎，六亲冰上炭，儿女眼前花，骨肉须防有鬼崇，萧墙内要起干戈，中年多蹭蹬，灾障业缠磨，受尽辛勤头渐白，身心方始得安和。",
            "此命经营须早，安闲却迟，风浪里独棹孤舟，丛林中夜逢猛虎，尴尬处会脱身，能见机于进退，成件心肠，杀人口嘴，小事不惊怕，大事会驱除，只嫌亲眷如水，对面分争吴越，莫嫌如此淡，乃命所招也。",
            "此命性硬气高，心慈口直，爱说人是非，多招人疑忌，逢人相敬重，遇事不惊疑，有威权，能发放，几番恩爱反成怨，只因多是热心肠。",
            "此命作事公平，为人稳重，不会拗曲作直，却能理白分清，会制度小人，能亲近君子，慕高敬上，好学思贤，只因立性不定，小辈常生妒忌，藏机不露胸中事，来往人情测度难。",
            "此命会得使风帆，不做瞒心事，爱添闲气力，不吃小便宜，虽然暗里藏刀，终是成中见破，这边经营犹未定，那边生出一头来，利名成败皆如此，方信惺惺不若呆。",
            "此命如枯木逢春，旱苗得雨，经过万千险阻，方遇无限精神，劳心苦力于四十年前，享福禄于五旬之内，不是寒水连底冻，那得梅花满园香。",
            "此命如松栽深岭，竹挺高干，根株固定，节操贞坚，心慈因赋定，性侠出天然，父母堂前客，终身管不全，兄弟云中月，清光半不图，六亲似雁分飞，夫妻同林宿鸟，回家不待忧煎，儿女三疏两负，莫嫌命里啾唧，过了风波稳驾船。"
    );

    public static String Say(String nian,String shi){
        String string = "年时百断：";
        for (int i = 0; i<10; i++) {
            if (nian.startsWith(niangan.get(i))) {
                for (int j = 0; j < 10; j++) {
                    if (shi.startsWith(shigan.get(j))) {
                        string += baisay.get(i*10+j);
                    }
                }
            }
        }
        return string;
    };
}
